---
kind: enumMember
id: F:Autodesk.Revit.DB.SpacingRuleLayout.FixedNumber
enum: Autodesk.Revit.DB.SpacingRuleLayout
source: html/163b0cc7-31f0-68b4-ced5-bea6d3c5abcc.htm
---
# Autodesk.Revit.DB.SpacingRuleLayout.FixedNumber

Fixed number of points or lines with uniform distance between them.